In [2]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib 
matplotlib.rcParams["figure.figsize"] = (20,10)

In [6]:
df = pd.read_csv("House_data.csv")
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [14]:
#Aggregate or group by  
df.groupby('area_type')['area_type'].agg("count")

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [28]:
#remove unrelated data 
df_clean = df.drop(['area_type','society','balcony','availability'],axis='columns')
df_clean.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [24]:
#count which columns has a null value and count them
df_clean.isnull().sum()
#in this example we have 73 bathroom nulls and the total rows are
# however we could also get median value and fill those values for missing one

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [34]:
# this will give good stat /info about the data counts mean median etc.
df_clean.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [36]:
df_clean_no_null = df_clean.dropna()

In [38]:
df_clean_no_null.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [40]:
df_clean_no_null.shape

(13246, 5)

In [48]:
#printe the distinct values of a column
df_clean_no_null['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [54]:
# since the data was string and number and bedroom and room we are going further massage it 
df_clean_no_null['bedroom_cnt'] = df_clean_no_null['size'].apply(lambda x:int(x.split(' ')[0]))

/var/folders/nb/7k8350y136xbvn00q__p4y4m0000gr/T/ipykernel_54183/794756741.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clean_no_null['bedroom_cnt'] = df_clean_no_null['size'].apply(lambda x:int(x.split(' ')[0]))

In [56]:
df_clean_no_null.head()

                   location       size total_sqft  bath   price  bedroom_cnt
0  Electronic City Phase II      2 BHK       1056   2.0   39.07            2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00            4
2               Uttarahalli      3 BHK       1440   2.0   62.00            3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00            3
4                  Kothanur      2 BHK       1200   2.0   51.00            2

In [70]:
df_clean_no_null['bedroom_cnt'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18])

In [60]:
df_clean_no_null[df_clean_no_null.bedroom_cnt>20]

,location,size,total_sqft,bath,price,bedroom_cnt
1718,2Electronic City Phase II,27 BHK,8000,27.0,230.0,27
4684,Munnekollal,43 Bedroom,2400,40.0,660.0,43